download.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-24 Fri 10:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Get Clasp</title>
<meta name="author" content="Alex Wood" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg-no-toc.css"/>

</head>
<body>
<div id="preamble" class="status">
<div id="top-menu">
<ul>
<li><a href="index.html">Clasp</a>
<ul>
<li><a href="news.html">News</a></li>
<li><a href="download.html">Download</a></li>
</ul></li>
<li><a href="index.html">Doc</a>
<ul>
<li><a href="license.html">License</a></li>
<li><a href="manual.html">Manual</a></li>
<li><a href="building.html">Building</a></li>
<li><a href="clbind-doc.html">Exposing C++ Libraries</a></li>
</ul></li>
<li><a href="index.html">Misc</a>
<ul>
<li><a href="community.html">Community</a></li>
<li><a href="projects.html">Projects</a></li>
<li><a href="media.html">Media</a></li>
<li><a href="acknowlegements.html">Acknowledgements</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="content" class="content">
<h1 class="title">Get Clasp</h1>
<p>
The most recent version of Clasp is v2.7.0, released January 21, 2025. See <a href="news.html">News</a> for release notes.
</p>

<div id="outline-container-org3a6e21f" class="outline-2">
<h2 id="org3a6e21f">Binaries</h2>
<div class="outline-text-2" id="text-org3a6e21f">
</div>
<div id="outline-container-orgb992e09" class="outline-3">
<h3 id="orgb992e09">Installing from the Nightly Homebrew Tap</h3>
<div class="outline-text-3" id="text-orgb992e09">
<p>
Binary packages for MacOS Catalina, Big Sur and Monterey are available from the
<code>clasp-developers/clasp</code> tap. Binary packages for Clasp and Cando are built nightly,
starting about 2:00 AM EST, and take about 4 hours to complete. To install Clasp, do the
following:
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install clasp-developers/clasp/clasp-cl
</pre>
</div>

<p>
To install Cando do the following:
</p>

<div class="org-src-container">
<pre class="src src-shell">brew install clasp-developers/clasp/cando
</pre>
</div>

<p>
These Homebrew formula can be built from source by adding the <code>--build-from-source</code> option,
and can be built directly the most recent commit by adding the <code>--HEAD</code> option.
</p>

<p>
After the initial install, to upgrade to the latest nightly build use <code>brew update &amp;&amp; brew upgrade</code>.
The brew update only needs to be done occasionally, to update homebrew itself.
</p>
</div>
</div>

<div id="outline-container-orgec07b1e" class="outline-3">
<h3 id="orgec07b1e">Installing from the Nightly Linux Package Repository</h3>
<div class="outline-text-3" id="text-orgec07b1e">
<p>
Binary packages for Clasp and Cando for Linux are built nightly starting about 2:00 AM EST and take about 4 hours to complete.
Currently packages are built for Ubuntu 22.04, Debian Bookworm (in testing), and Arch.
To add the package repository to your local system, and install either Clasp or Cando,
execute one of the following commands in a shell.
You may need to prefix these commands with <code>sudo</code> for root access.
</p>

<p>
Clasp:
</p>

<div class="org-src-container">
<pre class="src src-shell">bash -c "$(curl -fsSL https://www.thirdlaw.tech/pkg/clasp.sh)"
</pre>
</div>

<p>
Cando:
</p>

<div class="org-src-container">
<pre class="src src-shell">bash -c "$(curl -fsSL https://www.thirdlaw.tech/pkg/cando.sh)"
</pre>
</div>

<p>
If these scripts fail to detect your operating system correctly, then you can install
manually via one of the following commands:
</p>
</div>

<div id="outline-container-org350f70d" class="outline-4">
<h4 id="org350f70d">Debian Bookworm</h4>
<div class="outline-text-4" id="text-org350f70d">
<p>
Clasp:
</p>

<div class="org-src-container">
<pre class="src src-shell">curl -fsSL https://www.thirdlaw.tech/pkg/key.gpg | gpg --yes --dearmor --output /etc/apt/trusted.gpg.d/thirdlaw.gpg
add-apt-repository "deb https://www.thirdlaw.tech/pkg/bookworm/ ./"
apt-get update
apt-get install clasp-cl
</pre>
</div>

<p>
Cando:
</p>

<pre class="example">
curl -fsSL https://www.thirdlaw.tech/pkg/key.gpg | gpg --yes --dearmor --output /etc/apt/trusted.gpg.d/thirdlaw.gpg
add-apt-repository "deb https://www.thirdlaw.tech/pkg/bookworm/ ./"
apt-get update
apt-get install cando
</pre>
</div>
</div>

<div id="outline-container-org433c55c" class="outline-4">
<h4 id="org433c55c">Ubunty Jammy</h4>
<div class="outline-text-4" id="text-org433c55c">
<p>
Clasp:
</p>

<pre class="example">
curl -fsSL https://www.thirdlaw.tech/pkg/key.gpg | gpg --yes --dearmor --output /etc/apt/trusted.gpg.d/thirdlaw.gpg
add-apt-repository "deb https://www.thirdlaw.tech/pkg/jammy/ ./"
apt-get update
apt-get install clasp-cl
</pre>

<p>
Cando:
</p>

<pre class="example">
curl -fsSL https://www.thirdlaw.tech/pkg/key.gpg | gpg --yes --dearmor --output /etc/apt/trusted.gpg.d/thirdlaw.gpg
add-apt-repository "deb https://www.thirdlaw.tech/pkg/jammy/ ./"
apt-get update
apt-get install cando
</pre>
</div>
</div>

<div id="outline-container-org28a0989" class="outline-4">
<h4 id="org28a0989">Arch</h4>
<div class="outline-text-4" id="text-org28a0989">
<p>
Clasp:
</p>

<pre class="example">
curl -fsSL https://www.thirdlaw.tech/pkg/key.gpg | pacman-key --add -
pacman-key --lsign-key 009C1F20737D81230A0928CBC812E10EC39DF202
echo -e "\n[thirdlaw]\nServer = https://www.thirdlaw.tech/pkg/arch\n" &gt;&gt;/etc/pacman.conf
pacman -Sy --noconfirm clasp-cl-git
</pre>

<p>
Cando:
</p>

<pre class="example">
curl -fsSL https://www.thirdlaw.tech/pkg/key.gpg | pacman-key --add -
pacman-key --lsign-key 009C1F20737D81230A0928CBC812E10EC39DF202
echo -e "\n[thirdlaw]\nServer = https://www.thirdlaw.tech/pkg/arch\n" &gt;&gt;/etc/pacman.conf
pacman -Sy --noconfirm cando-git
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1d164b0" class="outline-2">
<h2 id="org1d164b0">Source</h2>
<div class="outline-text-2" id="text-org1d164b0">
<p>
Clasp's sources can be obtained from <a href="https://github.com/clasp-developers/clasp">GitHub</a> and built, as described in more detail in <a href="building.html">Building</a>.
</p>
</div>

<div id="outline-container-orgfb1b2f6" class="outline-3">
<h3 id="orgfb1b2f6">Arch</h3>
<div class="outline-text-3" id="text-orgfb1b2f6">
<p>
On Arch Linux, an AUR package is available for building from source. An AUR helper such as
<a href="https://github.com/Jguer/yay">yay</a> may be useful for this. Building in this manner using the <code>clasp-cl-git</code> package
will build Clasp, while cando-git will build Clasp and Cando.
If you do not have yay installed, you can install it with the following commands:
</p>

<div class="org-src-container">
<pre class="src src-shell">pacman -S --needed git base-devel
git clone https://aur.archlinux.org/yay.git
cd yay
makepkg -si
</pre>
</div>

<p>
Once yay is installed, you can install Clasp with <code>yay clasp-cl-git</code>, or Clasp and Cando
with <code>yay cando-git</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<center><p>
<a href="sitemap.html">Sitemap</a> &#x2014; <a href="license.html">License</a>
</p>
</center>
</div>
</body>
</html>
